INSERT INTO [dbo].[Talmidei_Hahamim]
           ([FullName]
           ,[HebrewName]
           ,[City]
           ,[Country]
           ,[Period]
           ,[YearOfBirth]
           ,[YearOfDeath]
           ,[KnownFor]
           ,[Notes]
           ,[Sources]
           ,[PlaceOfBirth]
           ,[PlaceOfPtira]
           ,[knownAs]
           ,[ImageUrl]
           ,[YoBHebrew]
           ,[YoPHebrew])
VALUES

-- 3. רבנו תם – רבי יעקב בן מאיר
(N'רבנו תם – רבי יעקב בן מאיר', N'רבנו תם', N'ריימס', N'צרפת', N'בעלי התוספות',
 1100, 1171, N'מגדולי בעלי התוספות', N'', N'', N'ריימס', N'ריימס', N'ר״ת', N'', N'', N''),

-- 4. ר׳ יהודה החסיד
(N'ר׳ יהודה החסיד', N'רבי יהודה החסיד', N'רגנסבורג', N'גרמניה', N'חסידי אשכנז',
 1140, 1217, N'מחבר ספר חסידים', N'', N'', N'רגנסבורג', N'רגנסבורג', N'', N'', N'', N''),

-- 5. ר׳ יצחק בן אשר הלוי
(N'ר׳ יצחק בן אשר הלוי', N'', N'מגנצא', N'גרמניה', N'בעלי התוספות',
 1105, 1175, N'', N'', N'', N'מגנצא', N'מגנצא', N'', N'', N'', N''),

-- 6. ר׳ אליעזר ממגנצא
(N'ר׳ אליעזר ממגנצא', N'ר׳ אליעזר בן נתן', N'מגנצא', N'גרמניה', N'בעלי התוספות',
 1090, 1170, N'מגדולי פוסקי אשכנז', N'', N'', N'מגנצא', N'מגנצא', N'', N'', N'', N''),

-- 7. ר׳ יחיאל מפאריס
(N'ר׳ יחיאל מפאריס', N'', N'פאריס', N'צרפת', N'בעלי התוספות',
 1210, 1286, N'ראש ישיבת פאריס; עלה לארץ ישראל', N'', N'', N'פאריס', N'ארץ ישראל', N'', N'', N'', N''),

-- 8. רבי משה בן חנוך
(N'רבי משה בן חנוך', N'', N'קורדובה', N'ספרד', N'ראשי ישיבות ספרד',
 950, 970, N'ראש ישיבת קורדובה', N'', N'', N'קורדובה', N'קורדובה', N'', N'', N'', N'');
